{
  "data": [
    {
      "id": 4,
      "title": "Template Four",
      "img": ["./img/template-4/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/Template-4/index.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/Template-4",
      "description": "Using HTML and CSS, I designed a web page with 15 sections. Page orientation has been optimized to be responsive to all screen sizes. In addition, simple animations using JavaScript have been added to enhance the page's appeal.",
      "p": "One simple web page using HTML and CSS with animation",
      "target": ["all", "html&css"]
    },
    {
      "id": 6,
      "title": "Dashboard One",
      "IdVideo": "ICi13AlYMVo",
      "img": ["./img/dashboard/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/Dashbord-1/index.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/Dashbord-1",
      "description": "The dashboard is designed with 8 fully responsive pages on all screen sizes. This includes the Home Page, Settings Page, Profile Page, Projects Page, Courses Page, Friends Page, Files Page, and Pricing Plans page. The design was implemented using HTML and CSS to achieve distinct visual appeal.",
      "p": "A dashboard consisting of 4 pages using css and html",
      "target": ["all", "html&css"]
    },
    {
      "id": 7,
      "title": "filter app",
      "IdVideo": "fOLKbtaoJ_U",
      "img": ["./img/filter-app/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/filter%20app/filter.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/filter%20app",
      "description": "application for image manipulation using HTML, CSS, and JavaScript. The image is downloaded, undergoes modification, and is then saved to the device upon completion of the editing process.",
      "p": "An application to add a filter to images consisting of html, css and js",
      "target": ["all", "js"]
    },
    {
      "id": 8,
      "title": "Memory game",
      "IdVideo": "qcQbav2rzb0",
      "img": ["./img/card-game/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/Memory%20Card/memory-game.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/Memory%20Card",
      "description": "The classic card game, known as 'Identical,' involves flipping cards sequentially and counting them upside down. The objective is to identify matching cards as they are revealed.",
      "p": "Memory card game using html, css, js",
      "target": ["all", "js"]
    },
    {
      "id": 9,
      "title": "Todo App",
      "IdVideo": "ZazOopf5RKk",
      "img": ["./img/todo-app/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/ToDo/ToDo.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/ToDo",
      "description": "The animation application is designed to add daily tasks that need to be accomplished throughout the day, with the ability to track task progress through marking or deleting them. The application relies on Local Storage for data persistence and features a responsive design for various screens, enhancing the user experience with added animation effects.",
      "p": "An application for saving tasks based on local storage using html, css, and js",
      "target": ["all", "js"]
    },
    {
      "id": 11,
      "title": "puzzle game",
      "IdVideo": "DRZraQR1yKM",
      "img": ["./img/puzzle/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/puzzle%20game/puzzle-game.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/puzzle%20game",
      "description": "Puzzle Game: A random selection forms the foundation of the puzzle game, where an image is fragmented into smaller pieces for users to arrange on the opposite side of the page. This interactive game was developed using JavaScript and the canvas element, Only works with computer.",
      "p": " Puzzle  game on computer screens only using html , css, js",
      "target": ["all", "js"]
    },
    {
      "id": 12,
      "title": "Medic cear",
      "img": ["./img/medic/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/Medic%20Cear/index.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/Medic%20Cear",
      "description": "A webpage for a medical complex is designed to showcase information about doctors and clients, including client evaluations of the facility. The page also features a form for booking appointments. The design is responsive across all screens, achieved through the use of Bootstrap and subtle animations.",
      "p": "web page for a medical complex to book appointments with doctors using html, css, and js",
      "target": ["all", "js"]
    },
    {
      "id": 15,
      "title": "quiz App",
      "img": ["./img/quiz/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/Quiz%20App/index.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/Quiz%20App",
      "description": "application has been developed where questions are presented sequentially. Upon completing an answer, users progress to the next question. At the end of the test, there's an option to display the results, including a progress bar indicating completed and remaining questions. Additionally, the application provides a final assessment of the student's level based on the answered questions.",
      "p": "Question program using html, css, js",
      "target": ["all", "js"]
    },
    {
      "id": 16,
      "title": "natega ",
      "IdVideo": "JiL7F32zcZo",
      "img": ["./img/natega/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/natega/index.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/natega",
      "description": "An application designed to showcase the results of final exams upon completion. The program displays the student's evaluation in each subject, accompanied by a graph illustrating the student's performance level in the exam.",
      "p": "application to display students’ results using html, css, and js",
      "target": ["all", "js"]
    },
    {
      "id": 17,
      "title": "Snake Game ",
      "IdVideo": "VWNn44v_M8A",
      "img": ["./img/snake/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/snake%20game/index.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/snake%20game",
      "description": "The renowned snake game is enhanced with customizable speed levels and can be controlled on computer screens using the keyboard. Additionally, it is optimized for mobile screens, allowing users to control the snake's movement directly through the phone screen.",
      "p": "The snake game is compatible with all screens using html, css, and js",
      "target": ["all", "js"]
    },
    {
      "id": 19,
      "title": "Quran Karem",
      "IdVideo": "zWzu4uaIPxo",
      "img": ["./img/quran-app/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/My-Project/quran%20karem/astmaa.html",
      "git": "https://github.com/AhmedOsama0js/My-Project/tree/main/quran%20karem",
      "description": "The Holy Qur'an application is a robust and feature-rich platform crafted using HTML, CSS, and JS complemented by a 4-page structure. The initial page encompasses the entire Holy Qur'an, featuring the voices of 46 reciters. It includes an engaging audio player with controls for adjusting volume, advancing, or delaying the recitation. The second page provides the text of the Qur'an, allowing users to click on any verse for reading. On the third page, there is a live radio broadcast featuring recitations from various sheikhs. The fourth page offers a live stream of the Holy Qur'an channel.",
      "p": "Dashboard consisting of 4 pages using html, css, and js",
      "target": ["all", "js"]
    },
    {
      "id": 20,
      "title": "Notes React App",
      "IdVideo": "ddWZdJPCajg",
      "img": ["./img/note/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/note/",
      "git": "https://github.com/AhmedOsama0js/note",
      "description": "A straightforward note-taking application that utilizes local storage for data retention. Users can save notes along with timestamps, and have the option to delete or modify them. The application was developed using the React framework.",
      "p": "Note taking app using react, local storage, bootstrap",
      "target": ["all", "react"]
    },
    {
      "id": 21,
      "title": "millionaire Game",
      "img": ["./img/millionaire/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/millionaireGame/",
      "git": "https://github.com/AhmedOsama0js/millionaireGame",
      "description": "The 'Who Wants to Be a Millionaire' game was crafted using React. It revolves around answering health-related questions to progress through levels and is designed to be responsive across all screens.",
      "p": "Who Wants to Be a Millionaire game using React and Bootstrap",
      "target": ["all", "react"]
    },
    {
      "id": 23,
      "title": "react-dashboard-2",
      "IdVideo": "x3SVM3h9Fho",
      "img": ["./img/react-dashboard-2/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/React-Dashboard-2/",
      "git": "https://github.com/AhmedOsama0js/React-Dashboard-2",
      "description": "This project, developed using React, provides a comprehensive showcase of movie details. It boasts numerous features, displaying each film with an attractive layout and showcasing movie ratings. Additionally, it offers extra functionalities such as Arabic language translation and the ability to search for specific movies, enhancing the user experience and making the project both enjoyable and practical.",
      "p": "4-page dashboard using React, Bootstrap and the echart library",
      "target": ["all", "react"]
    },
    {
      "id": 24,
      "title": "EG-Movies",
      "IdVideo": "xnzhX35hRI4",
      "img": ["./img/eg-movies/1.jpg"],
      "demo": "https://ahmedosama0js.github.io/eg-moves/",
      "git": "https://github.com/AhmedOsama0js/eg-moves",
      "description": "This project, developed using React, provides a comprehensive showcase of movie details. It boasts numerous features, displaying each film with an attractive layout and showcasing movie ratings. Additionally, it offers extra functionalities such as Arabic language translation and the ability to search for specific movies, enhancing the user experience and making the project both enjoyable and practical. Moreover, it is responsive, ensuring compatibility with screens of all sizes.",
      "p": "The React project displays movie details with an appealing, responsive design for all screens. It includes movie ratings, Arabic translation, and search functionality, making it practical and enjoyable.",
      "target": ["all", "react"]
    },
    {
      "id": 25,
      "title": "ebda3 academy ",
      "img": ["./img/ebda3acadmy/1.jpg"],
      "demo": "https://ebda3acadmy.com/",
      "description": "Ebda3 Academy is an online educational platform that offers a wide range of courses across various fields. The website features a clean and intuitive design, providing users with easy access to different courses. Each course includes detailed information, pricing, and instructor details, along with an easy registration process. The platform also supports video tutorials, interactive quizzes, and a seamless user experience across all devices, ensuring learning is both engaging and efficient.",
      "p": "Ebda3 Academy is an online platform offering diverse educational courses with a user-friendly interface, detailed course info, video tutorials, and quizzes, optimized for all devices.",
      "target": ["all", "react"]
    },
    {
      "id": 26,
      "title": "engli-z",
      "img": ["./img/engli-z/1.jpg"],
      "demo": "https://www.engli-z.com/",
      "description": "Engli-Z is an online platform designed to help users improve their English language skills. The website offers a wide variety of interactive courses, including grammar lessons, vocabulary building, and pronunciation practice. With a user-friendly interface and a variety of learning tools, Engli-Z allows users to track their progress and engage in practical exercises. The platform is fully responsive, ensuring a seamless experience across all devices, making it an ideal solution for learners of all levels.",
      "p": "Engli-Z provides interactive online English courses covering grammar, vocabulary, and pronunciation. It tracks progress, offers practical exercises, and is fully responsive for all devices.",
      "target": ["all", "react"]
    }
  ]
}
