{
  "data": [
  {
    "id":1,
    "title": "القالب الرابع",
    "img": ["./img/template-4/1.jpg","./img/template-4/2.jpg","./img/template-4/3.jpg","./img/template-4/4.jpg","./img/template-4/5.jpg","./img/template-4/6.jpg","./img/template-4/7.jpg","./img/template-4/8.jpg","./img/template-4/9.jpg","./img/template-4/10.jpg","./img/template-4/11.jpg","./img/template-4/12.jpg","./img/template-4/13.jpg","./img/template-4/14.jpg"],
    "demo": "https://ahmedosama0js.github.io/My-Project/Template-4/index.html",
    "description": "باستخدام HTML و CSS، قمت بتصميم صفحة ويب تحتوي على 15 قسمًا. تم تحسين التوافق مع جميع أحجام الشاشات، بالإضافة إلى إضافة تأثيرات بسيطة باستخدام JavaScript لجعل الصفحة أكثر جاذبية.",
    "p": "صفحة ويب بسيطة باستخدام HTML و CSS مع تأثيرات حركية.",
    "target" : ["all","html&css"]
  },
  {
    "id":2,
    "title": "لوحة التحكم الأولى",
    "img": ["./img/dashboard/1.jpg","./img/dashboard/2.jpg","./img/dashboard/3.jpg","./img/dashboard/4.jpg","./img/dashboard/5.jpg","./img/dashboard/6.jpg","./img/dashboard/7.jpg","./img/dashboard/8.jpg"],
    "demo": "https://ahmedosama0js.github.io/My-Project/Dashbord-1/index.html",
    "description": "تم تصميم لوحة تحكم تحتوي على 8 صفحات متجاوبة بالكامل مع جميع أحجام الشاشات. تشمل هذه الصفحات: الصفحة الرئيسية، صفحة الإعدادات، صفحة الملف الشخصي، صفحة المشاريع، صفحة الدورات، صفحة الأصدقاء، صفحة الملفات، وصفحة خطط الأسعار. تم تنفيذ التصميم باستخدام HTML و CSS ليحقق مظهرًا متميزًا.",
    "p": "لوحة تحكم مكونة من 4 صفحات باستخدام HTML و CSS.",
    "target" : ["all","html&css"]
  },
  {
    "id":3,
    "title": "الصفحة الشخصية",
    "img":["./img/personal-page/1.jpg","./img/personal-page/2.jpg","./img/personal-page/3.jpg"],
    "demo": "https://ahmedosama0js.github.io/My-Project/personal%20page/index.html",
    "description": "قمت بتطوير صفحة شخصية باستخدام HTML، CSS، JavaScript، و Bootstrap. تعرض الصفحة معلومات شخصية للمستخدم مع إمكانية تخصيص ألوان الصفحة الرئيسية. يتم حفظ البيانات محليًا باستخدام التخزين المحلي. يتميز التصميم بتأثيرات حركية وهو متجاوب مع مختلف أحجام الشاشات.",
    "p": "صفحة شخصية باستخدام HTML، CSS، و JavaScript.",
    "target" : ["all","js"]
  },
  {
    "id":4,
    "title": "الرعاية الطبية",
    "img": ["./img/medic/1.jpg","./img/medic/2.jpg","./img/medic/3.jpg","./img/medic/4.jpg","./img/medic/5.jpg","./img/medic/6.jpg"],
    "demo": "https://ahmedosama0js.github.io/My-Project/Medic%20Cear/index.html",
    "description": "تم تصميم صفحة ويب لمجمع طبي تعرض معلومات حول الأطباء والعملاء، بما في ذلك تقييمات العملاء للمجمع الطبي. كما تتضمن الصفحة نموذجًا لحجز المواعيد. تم تصميم الموقع ليكون متجاوبًا مع جميع الأجهزة باستخدام Bootstrap مع تأثيرات حركية خفيفة.",
    "p": "صفحة ويب لمجمع طبي لحجز المواعيد مع الأطباء باستخدام HTML، CSS، و JavaScript.",
    "target" : ["all","js"]
  },
  {
    "id":5,
    "title": "نتيجة الامتحانات",
    "img": ["./img/natega/1.jpg"],
    "demo": "https://ahmedosama0js.github.io/My-Project/natega/index.html",
    "description": "تطبيق مصمم لعرض نتائج الامتحانات النهائية فور ظهورها. يعرض البرنامج تقييم الطالب في كل مادة، بالإضافة إلى رسم بياني يوضح مستوى أداء الطالب في الامتحان.",
    "p": "تطبيق لعرض نتائج الطلاب باستخدام HTML، CSS، و JavaScript.",
    "target" : ["all","js"]
  },
  {
    "id":6,
    "title": "القرآن الكريم",
    "img": ["./img/quran-app/1.jpg","./img/quran-app/2.jpg","./img/quran-app/3.jpg","./img/quran-app/4.jpg"],
    "demo": "https://ahmedosama0js.github.io/My-Project/quran%20karem/astmaa.html",
    "description": "تطبيق القرآن الكريم عبارة عن منصة متكاملة تم إنشاؤها باستخدام HTML، CSS، و JavaScript. يتكون من 4 صفحات، حيث تعرض الصفحة الأولى القرآن الكريم كاملًا بصوت 46 قارئًا مع مشغل صوتي يتيح التحكم في الصوت. تعرض الصفحة الثانية نصوص القرآن الكريم مع إمكانية النقر على أي آية لقراءتها. تقدم الصفحة الثالثة بثًا إذاعيًا مباشرًا لتلاوات مختلفة، بينما توفر الصفحة الرابعة بثًا مباشرًا لقناة القرآن الكريم.",
      "p": "لوحة تحكم مكونة من 4 صفحات باستخدام HTML، CSS، و JavaScript.",
    "target" : ["all","js"]
  },
  {
    "id":7,
    "title": "لوحة تحكم React",
    "img": ["./img/react-dashboard-1/1.jpg","./img/react-dashboard-1/2.jpg","./img/react-dashboard-1/3.jpg"],
    "demo": "https://ahmedosama0js.github.io/React-Dashboard-1/",
    "description": "تتكون لوحة التحكم من ثلاث صفحات رئيسية. تعرض الصفحة الرئيسية جدول المنتجات مع قيمتها وتفاصيل المبيعات، إلى جانب رسم بياني لعرض البيانات. تعرض الصفحة الثانية جدول العملاء مع معلوماتهم وأحدث طلباتهم، بينما تركز الصفحة الثالثة على عرض المنتجات والطلبات الأخيرة مع تفاصيل طرق الدفع.",
      "p": "لوحة تحكم مكونة من 4 صفحات باستخدام React و Bootstrap.",
    "target" : ["all","react"]
  },
  {
    "id":8,
          "title": "لوحة تحكم React 2",
    "img": ["./img/react-dashboard-2/1.jpg","./img/react-dashboard-2/2.jpg","./img/react-dashboard-2/3.jpg","./img/react-dashboard-2/4.jpg"],
    "demo": "https://ahmedosama0js.github.io/React-Dashboard-2/",
    "description": "مشروع تم تطويره باستخدام React، يعرض تفاصيل الأفلام بشكل شامل مع تصميم جذاب. يتضمن ميزات مثل تقييمات الأفلام، الترجمة للغة العربية، وإمكانية البحث عن الأفلام، مما يجعل التجربة أكثر متعة وفائدة.",
      "p": "لوحة تحكم مكونة من 4 صفحات باستخدام React و Bootstrap ومكتبة Echarts.",
    "target" : ["all","react"]
  },
  {
  "id":9,
  "title": "EG-Movies",
  "img": ["./img/eg-movies/1.jpg","./img/eg-movies/2.jpg"],
  "demo": "https://ahmedosama0js.github.io/eg-moves/",
  "description": "تم تطوير هذا المشروع باستخدام React ليقدم عرضًا شاملاً لتفاصيل الأفلام. يتميز بواجهة جذابة تعرض كل فيلم مع التقييمات الخاصة به. بالإضافة إلى ذلك، يوفر ميزات إضافية مثل الترجمة إلى اللغة العربية وإمكانية البحث عن الأفلام، مما يعزز تجربة المستخدم ويجعل المشروع ممتعًا وعمليًا. كما أنه متجاوب مع جميع أحجام الشاشات لضمان تجربة مثالية.",
  "p": "مشروع React يعرض تفاصيل الأفلام بتصميم جذاب ومتجاوب مع جميع الشاشات. يشمل تقييمات الأفلام، والترجمة إلى العربية، ووظيفة البحث، مما يجعله عمليًا وممتعًا.",
  "target" : ["all","react"]
  },
  {
    "id":10,
    "title": "ابداع التعليميه",
    "img": ["./img/ebda3/1.jpg","./img/ebda3/2.jpg","./img/ebda3/3.jpg"],
    "demo": "https://ebda3acadmy.com/",
  "description": "منصة إبداع التعليمية هي نظام تعليمي متكامل تم تطويره باستخدام React لتوفير تجربة تعليمية سلسة ومبتكرة. تتيح المنصة للطلاب تصفح الدورات التعليمية بسهولة، مع إمكانية متابعة الفيديوهات بجودة عالية، وإدارة تقدمهم التعليمي بواجهة احترافية. كما تدعم المنصة أنظمة الحماية المتقدمة لضمان أمان المحتوى، وتوفر تجربة مستخدم متجاوبة مع جميع الأجهزة.",
  "p": "منصة تعليمية متكاملة تتيح للطلاب الوصول إلى الدورات بسهولة، مع ميزات متقدمة مثل إدارة المحتوى وحماية الفيديوهات وتجربة مستخدم سلسة ومتجاوبة.",
  "target" : ["all","react"]
  },
  {
  "id":11,
  "title": "منصة engli-z",
  "img": ["./img/engli-z/1.jpg","./img/engli-z/2.jpg","./img/engli-z/3.jpg","./img/engli-z/4.jpg"],
  "demo": "https://www.engli-z.com/",
  "description": "منصة Engli-Z هي موقع تعليمي متخصص في تعليم اللغة الإنجليزية، تم تطويره باستخدام React لتوفير تجربة تعليمية سلسة وتفاعلية. يقدم الموقع دروسًا مصممة بعناية تشمل مقاطع فيديو تعليمية، تمارين تفاعلية، واختبارات لتقييم مستوى الطالب. كما يدعم المنصة الوصول السهل إلى المحتوى، مما يساعد المتعلمين على تحسين مهاراتهم اللغوية بكفاءة.",
  "p": "منصة تعليمية متخصصة في تدريس اللغة الإنجليزية، تقدم دروسًا بالفيديو، تمارين تفاعلية، واختبارات تقييمية لتعزيز مهارات الطلاب في اللغة.",
  "target" : ["all","react"]
  }
  ]
}
